** Org Files and
   :PROPERTIES:
   :ID: 6ed4d139-0420-4e09-acfb-95bb938be86d
   :END:
   :LOGBOOK:
   - State "ON"         from "OFF"        [2023-10-31 вт 12:42]
   :END:

#+BEGIN_SRC emacs-lisp
;; Associate .org and .org_archive with org-mode
(add-to-list 'auto-mode-alist '("\\.\\(org\\|org_archive\\)$" . org-mode))

;; Disable automatic line breaking in Org mode
(add-hook 'org-mode-hook (lambda () (auto-fill-mode -1)))

(setq org-dir
      (cond
       ((eq system-type 'darwin) "/Users/andrew/org")
       ((eq system-type 'gnu/linux) "/home/andrew/workspace/org")))

;; Recursively find all .org files in org-dir
(setq org-agenda-files
      (directory-files-recursively org-dir "\\.org$"))
#+END_SRC

#+RESULTS:
| /home/andrew/workspace/org/work/market.org | /home/andrew/workspace/org/work/proxyzeus.org | /home/andrew/workspace/org/workspace/dairy.org | /home/andrew/workspace/org/workspace/english.org | /home/andrew/workspace/org/workspace/ideas_2025.org | /home/andrew/workspace/org/workspace/inbox.org | /home/andrew/workspace/org/workspace/newtend.org | /home/andrew/workspace/org/workspace/proxy_ua.org | /home/andrew/workspace/org/workspace/rest.org | /home/andrew/workspace/org/workspace/workspace.org | /home/andrew/workspace/org/books.org | /home/andrew/workspace/org/english.org | /home/andrew/workspace/org/homework.org | /home/andrew/workspace/org/self_dev.org | /home/andrew/workspace/org/workspace.org |



** Custom Agenda views
:PROPERTIES:
:ID:       9a602078-bdff-4044-9da2-03c1601a5a20
:END:

#+BEGIN_SRC emacs-lisp
(setq org-agenda-custom-commands
      '(("d" "Custom Day Overview"
         ((agenda "" ((org-agenda-span 'day)
                      (org-agenda-include-diary t)
                      (org-agenda-show-log t)
                      (org-agenda-prefix-format '((agenda . " %i %-12:c%?-12t% s %e ")))
                      (org-agenda-time-grid '((daily today) (600 800 1000 1200 1400 1600 1800 2000 2200) "......" "----------------"))))))))
#+END_SRC

#+RESULTS:
| d | Custom Day Overview | ((agenda  ((org-agenda-span 'day) (org-agenda-include-diary t) (org-agenda-show-log t) (org-agenda-prefix-format '((agenda .  %i %-12:c%?-12t% s %e ))) (org-agenda-time-grid '((daily today) (600 800 1000 1200 1400 1600 1800 2000 2200) ...... ----------------))))) |

*** Configure todo keywords and their faces
:PROPERTIES:
:ID:       0afe7a33-dae1-49c1-a4c2-9bfb9b573e2a
:END:
#+BEGIN_SRC emacs-lisp
(setq org-todo-keywords '((sequence "TODO(t)" "PROC(p)" "|" "DONE(d!)" "CANCEL(c)")))

(setq org-todo-keyword-faces '(("TODO" . (:foreground "red" :weight bold))
                               ("PROC" . (:foreground "yellow" :weight bold))
                               ("DONE" . (:foreground "green" :weight bold))
                               ("CANCEL" . (:foreground "blue" :weight bold))))
#+END_SRC

#+RESULTS:
| TODO   | :foreground | red    | :weight | bold |
| PROC   | :foreground | yellow | :weight | bold |
| DONE   | :foreground | green  | :weight | bold |
| CANCEL | :foreground | blue   | :weight | bold |

*** Install and enable org-bullets mode for prettier bullets
:PROPERTIES:
:ID:       4ebc5141-ccaa-4984-a9be-4ea389b1a598
:END:
#+BEGIN_SRC emacs-lisp
(use-package org-bullets
  :ensure t
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "○" "◉" "○" "◉")))
#+END_SRC

#+RESULTS:
| #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | (lambda nil (add-hook 'before-save-hook 'my-org-add-ids-to-headlines-in-file nil 'local)) | org-clock-load | org-bullets-mode | my-org-mode-visual-tweaks | (lambda nil (auto-fill-mode -1)) | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

